In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
from sklearn.linear_model import LinearRegression

In [5]:
from word2number import w2n

In [6]:
df = pd.read_csv("/Users/vishalbarad/Desktop/Python/Regression/multipleregression/hiring.csv")

In [7]:
df.head(8)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [8]:
score = df['test_score(out of 10)'].mean()

In [9]:
score

7.857142857142857

In [10]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(score)

In [11]:
df['test_score(out of 10)'].astype(int)

0     8
1     8
2     6
3    10
4     9
5     7
6     7
7     7
Name: test_score(out of 10), dtype: int64

### Here we use word2number package to convert word of first column to number

In [12]:
 print(w2n.word_to_num('two point three')) #e.g

2.3

In [13]:
df['experience']

0       NaN
1       NaN
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [14]:
df['experience'] = df['experience'].replace(np.nan,'zero')

In [16]:
df['experience']

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [21]:
exp=[]
for i in df['experience']:
    exp.append(w2n.word_to_num(i))

In [22]:
df['experience']=exp

In [24]:
df['experience']

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [25]:
reg = LinearRegression()

In [26]:
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

### predict salary of emp whose exp=2,testscore=9 and interviewscore=6

In [27]:
print("salary is",reg.predict([[2,9,6]]))

salary is [53290.89255945]